app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC LIMIT ?  [["LIMIT", 5]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 2]]
---
  def index
    @produtos_por_nome = Produto.order(:nome).limit 5
    @produtos_por_preco = Produto.order(:preco).limit 2

INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Camisa xadrez"], ["descricao", "Teste"], ["quantidade", 10], ["preco", 100.0], ["created_at", "2018-06-04 23:34:45.199949"], ["updated_at", "2018-06-04 23:34:45.199949"]]
---
  def create
    @produto = Produto.new produto_params
    if @produto.save

UPDATE "produtos" SET "descricao" = ?, "departamento_id" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["descricao", "Teste"], ["departamento_id", 1], ["updated_at", "2018-06-05 16:39:33.163017"], ["id", 2]]
---
  def update
    if @produto.update produto_params

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_produto
    id = params[:id]
    @produto = Produto.find(id)